tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "chezmoi"

# Terminal tweaks/apps

brew "bat"
brew "htop"
brew "wget"
brew "pandoc"
brew "terminal-notifier"
brew "tree"
brew "trash"



# GUI tweeks

#https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "suspicious-package"
cask "apparency"
cask "quicklookase"
cask "qlvideo"



# GUI Apps
brew "mas"

cask "iterm2"
cask "lastpass" # Need this already
cask "alfred"
cask "notion"
cask "visual-studio-code"
cask "rectangle"
cask "kap"


# Fonts

cask "font-open-dyslexic"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-for-powerline-bold"
#GraramondNo8 maybe it is:
# cask "font-eb-garamond"
#cask "font-charter"  # should be preinstalled on macOS


# Large apps, so I can use the other stuff while this is installing
mas "Xcode", id: 497799835
